Revit 2024 API
FilledRegionType.ForegroundPatternId Property
 The foreground fill pattern Id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public ElementId ForegroundPatternId { get; set; }
Visual Basic
Public Property ForegroundPatternId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ ForegroundPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 When the FilledRegionAttributes element is in a family then the FillPattern used for a foreground pattern must have a 'Drafting' target. In addition, when the FilledRegionAttributes element is in a family, the pattern cannot be the solid fill pattern unless the 'IsMasking' property is set to true. InvalidElementId is used when there is no foreground pattern
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The patternId must either be InvalidElementId or represent a valid FillPatternElement. -or- When setting this property: In a family the patternId must be a 'Drafting' pattern. -or- When setting this property: In a family the patternId can not be a solid fill pattern if the 'IsMasking' property is false.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace